tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1777_tdd.h
#define PRG3INS                       3323
#define RG3INS0                       3324
#define PRG3INS_INS0                  3325
#define PRG3INS_INS                   3326
#define RG3INS1                       3327
#define PRG3INS_INS1                  3328
#define PRG3INS_INS2                  3329
#define RG3INS2                       3330
#define RG3INS3                       3331
#define PRG3INS_INS3                  3332
#define PRG3CON0                      3333
#define PRG3CON0_GO                   3334
#define RG3GO                         3335
#define RG3OS                         3336
#define PRG3CON0_OS                   3337
#define PRG3CON0_MODE                 3338
#define RG3MODE                       3339
#define PRG3CON0_MODE0                3340
#define RG3MODE0                      3341
#define PRG3CON0_MODE1                3342
#define RG3MODE1                      3343
#define PRG3CON0_REDG                 3344
#define RG3REDG                       3345
#define PRG3CON0_FEDG                 3346
#define RG3FEDG                       3347
#define PRG3CON0_EN                   3348
#define RG3EN                         3349
#define PRG3CON1                      3350
#define PRG3CON1_RPOL                 3351
#define RG3RPOL                       3352
#define RG3FPOL                       3353
#define PRG3CON1_FPOL                 3354
#define PRG3CON1_RDY                  3355
#define RG3RDY                        3356
#define PRG3CON2                      3357
#define PRG3CON2_ISET                 3358
#define RG3ISET                       3359
#define RG3ISET0                      3360
#define PRG3CON2_ISET0                3361
#define PRG3CON2_ISET1                3362
#define RG3ISET1                      3363
#define RG3ISET2                      3364
#define PRG3CON2_ISET2                3365
#define RG3ISET3                      3366
#define PRG3CON2_ISET3                3367
#define PRG3CON2_ISET4                3368
#define RG3ISET4                      3369
#define COG3PHR                       3370
#define COG3PHR_PHR0                  3371
#define G3PHR0                        3372
#define COG3PHR_PHR                   3373
#define G3PHR1                        3374
#define COG3PHR_PHR1                  3375
#define COG3PHR_PHR2                  3376
#define G3PHR2                        3377
#define COG3PHR_PHR3                  3378
#define G3PHR3                        3379
#define COG3PHR_PHR4                  3380
#define G3PHR4                        3381
#define G3PHR5                        3382
#define COG3PHR_PHR5                  3383
#define COG3PHF                       3384
#define COG3PHF_PHF                   3385
#define G3PHF0                        3386
#define COG3PHF_PHF0                  3387
#define COG3PHF_PHF1                  3388
#define G3PHF1                        3389
#define COG3PHF_PHF2                  3390
#define G3PHF2                        3391
#define COG3PHF_PHF3                  3392
#define G3PHF3                        3393
#define COG3PHF_PHF4                  3394
#define G3PHF4                        3395
#define COG3PHF_PHF5                  3396
#define G3PHF5                        3397
#define COG3BLKR                      3398
#define COG3BLKR_BLKR0                3399
#define G3BLKR0                       3400
#define COG3BLKR_BLKR                 3401
#define COG3BLKR_BLKR1                3402
#define G3BLKR1                       3403
#define COG3BLKR_BLKR2                3404
#define G3BLKR2                       3405
#define COG3BLKR_BLKR3                3406
#define G3BLKR3                       3407
#define COG3BLKR_BLKR4                3408
#define G3BLKR4                       3409
#define COG3BLKR_BLKR5                3410
#define G3BLKR5                       3411
#define COG3BLKF                      3412
#define G3BLKF0                       3413
#define COG3BLKF_BLKF                 3414
#define COG3BLKF_BLKF0                3415
#define G3BLKF1                       3416
#define COG3BLKF_BLKF1                3417
#define G3BLKF2                       3418
#define COG3BLKF_BLKF2                3419
#define G3BLKF3                       3420
#define COG3BLKF_BLKF3                3421
#define G3BLKF4                       3422
#define COG3BLKF_BLKF4                3423
#define G3BLKF5                       3424
#define COG3BLKF_BLKF5                3425
#define COG3DBR                       3426
#define G3DBR0                        3427
#define COG3DBR_DBR0                  3428
#define COG3DBR_DBR                   3429
#define G3DBR1                        3430
#define COG3DBR_DBR1                  3431
#define G3DBR2                        3432
#define COG3DBR_DBR2                  3433
#define G3DBR3                        3434
#define COG3DBR_DBR3                  3435
#define G3DBR4                        3436
#define COG3DBR_DBR4                  3437
#define G3DBR5                        3438
#define COG3DBR_DBR5                  3439
#define COG3DBF                       3440
#define G3DBF                         3441
#define G3DBF0                        3442
#define COG3DBF_DBF0                  3443
#define G3DBF1                        3444
#define COG3DBF_DBF1                  3445
#define G3DBF2                        3446
#define COG3DBF_DBF2                  3447
#define G3DBF3                        3448
#define COG3DBF_DBF3                  3449
#define G3DBF4                        3450
#define COG3DBF_DBF4                  3451
#define G3DBF5                        3452
#define COG3DBF_DBF5                  3453
#define COG3CON0                      3454
#define G3MD                          3455
#define COG3CON0_MD                   3456
#define G3MD0                         3457
#define COG3CON0_MD0                  3458
#define G3MD1                         3459
#define COG3CON0_MD1                  3460
#define COG3CON0_MD2                  3461
#define G3MD2                         3462
#define G3CS                          3463
#define COG3CON0_CS0                  3464
#define G3CS0                         3465
#define COG3CON0_CS                   3466
#define COG3CON0_CS1                  3467
#define G3CS1                         3468
#define COG3CON0_LD                   3469
#define G3LD                          3470
#define G3EN                          3471
#define COG3CON0_EN                   3472
#define COG3CON1                      3473
#define G3POLA                        3474
#define COG3CON1_POLA                 3475
#define G3POLB                        3476
#define COG3CON1_POLB                 3477
#define G3POLC                        3478
#define COG3CON1_POLC                 3479
#define COG3CON1_POLD                 3480
#define G3POLD                        3481
#define G3FDBS                        3482
#define COG3CON1_FDBS                 3483
#define COG3CON1_RDBS                 3484
#define G3RDBS                        3485
#define COG3RIS0                      3486
#define G3RIS0                        3487
#define COG3RIS0_RIS0                 3488
#define G3RIS1                        3489
#define COG3RIS0_RIS1                 3490
#define G3RIS2                        3491
#define COG3RIS0_RIS2                 3492
#define G3RIS3                        3493
#define COG3RIS0_RIS3                 3494
#define G3RIS4                        3495
#define COG3RIS0_RIS4                 3496
#define G3RIS5                        3497
#define COG3RIS0_RIS5                 3498
#define G3RIS6                        3499
#define COG3RIS0_RIS6                 3500
#define G3RIS7                        3501
#define COG3RIS0_RIS7                 3502
#define COG3RIS1                      3503
#define G3RIS9                        3504
#define COG3RIS1_RIS9                 3505
#define G3RIS11                       3506
#define COG3RIS1_RIS11                3507
#define G3RIS12                       3508
#define COG3RIS1_RIS12                3509
#define G3RIS13                       3510
#define COG3RIS1_RIS13                3511
#define G3RIS14                       3512
#define COG3RIS1_RIS14                3513
#define G3RIS15                       3514
#define COG3RIS1_RIS15                3515
#define COG3RSIM0                     3516
#define G3RSIM0                       3517
#define COG3RSIM0_RSIM0               3518
#define G3RSIM1                       3519
#define COG3RSIM0_RSIM1               3520
#define G3RSIM2                       3521
#define COG3RSIM0_RSIM2               3522
#define G3RSIM3                       3523
#define COG3RSIM0_RSIM3               3524
#define G3RSIM4                       3525
#define COG3RSIM0_RSIM4               3526
#define G3RSIM5                       3527
#define COG3RSIM0_RSIM5               3528
#define G3RSIM6                       3529
#define COG3RSIM0_RSIM6               3530
#define G3RSIM7                       3531
#define COG3RSIM0_RSIM7               3532
#define COG3RSIM1                     3533
#define G3RSIM9                       3534
#define COG3RSIM1_RSIM9               3535
#define G3RSIM11                      3536
#define COG3RSIM1_RSIM11              3537
#define G3RSIM12                      3538
#define COG3RSIM1_RSIM12              3539
#define G3RSIM13                      3540
#define COG3RSIM1_RSIM13              3541
#define G3RSIM14                      3542
#define COG3RSIM1_RSIM14              3543
#define G3RSIM15                      3544
#define COG3RSIM1_RSIM15              3545
#define COG3FIS0                      3546
#define COG3FIS0_FIS0                 3547
#define G3FIS0                        3548
#define COG3FIS0_FIS1                 3549
#define G3FIS1                        3550
#define COG3FIS0_FIS2                 3551
#define G3FIS2                        3552
#define COG3FIS0_FIS3                 3553
#define G3FIS3                        3554
#define COG3FIS0_FIS4                 3555
#define G3FIS4                        3556
#define COG3FIS0_FIS5                 3557
#define G3FIS5                        3558
#define COG3FIS0_FIS6                 3559
#define G3FIS6                        3560
#define G3FIS7                        3561
#define COG3FIS0_FIS7                 3562
#define COG3FIS1                      3563
#define G3FIS9                        3564
#define COG3FIS1_FIS9                 3565
#define COG3FIS1_FIS11                3566
#define G3FIS11                       3567
#define G3FIS12                       3568
#define COG3FIS1_FIS12                3569
#define G3FIS13                       3570
#define COG3FIS1_FIS13                3571
#define G3FIS14                       3572
#define COG3FIS1_FIS14                3573
#define G3FIS15                       3574
#define COG3FIS1_FIS15                3575
#define COG3FSIM0                     3576
#define COG3FSIM0_FSIM0               3577
#define G3FSIM0                       3578
#define G3FSIM1                       3579
#define COG3FSIM0_FSIM1               3580
#define COG3FSIM0_FSIM2               3581
#define G3FSIM2                       3582
#define COG3FSIM0_FSIM3               3583
#define G3FSIM3                       3584
#define G3FSIM4                       3585
#define COG3FSIM0_FSIM4               3586
#define COG3FSIM0_FSIM5               3587
#define G3FSIM5                       3588
#define COG3FSIM0_FSIM6               3589
#define G3FSIM6                       3590
#define COG3FSIM0_FSIM7               3591
#define G3FSIM7                       3592
#define COG3FSIM1                     3593
#define COG3FSIM1_FSIM9               3594
#define G3FSIM9                       3595
#define COG3FSIM1_FSIM11              3596
#define G3FSIM11                      3597
#define G3FSIM12                      3598
#define COG3FSIM1_FSIM12              3599
#define COG3FSIM1_FSIM13              3600
#define G3FSIM13                      3601
#define G3FSIM14                      3602
#define COG3FSIM1_FSIM14              3603
#define G3FSIM15                      3604
#define COG3FSIM1_FSIM15              3605
#define COG3ASD0                      3606
#define COG3ASD0_ASDAC0               3607
#define G3ASDAC                       3608
#define G3ASDAC0                      3609
#define COG3ASD0_ASDAC                3610
#define COG3ASD0_ASDAC1               3611
#define G3ASDAC1                      3612
#define G3ASDBD                       3613
#define COG3ASD0_ASDBD                3614
#define G3ASDBD0                      3615
#define COG3ASD0_ASDBD0               3616
#define COG3ASD0_ASDBD1               3617
#define G3ASDBD1                      3618
#define COG3ASD0_ASREN                3619
#define COG3ASD0_ARSEN                3620
#define G3ASREN                       3621
#define G3ARSEN                       3622
#define COG3ASD0_ASE                  3623
#define G3ASE                         3624
#define COG3ASD1                      3625
#define G3AS0E                        3626
#define COG3ASD1_AS0E                 3627
#define G3AS1E                        3628
#define COG3ASD1_AS1E                 3629
#define COG3ASD1_AS2E                 3630
#define G3AS2E                        3631
#define G3AS3E                        3632
#define COG3ASD1_AS3E                 3633
#define G3AS4E                        3634
#define COG3ASD1_AS4E                 3635
#define G3AS5E                        3636
#define COG3ASD1_AS5E                 3637
#define G3AS6E                        3638
#define COG3ASD1_AS6E                 3639
#define COG3ASD1_AS7E                 3640
#define G3AS7E                        3641
#define COG3STR                       3642
#define COG3STR_STRA                  3643
#define G3STRA                        3644
#define COG3STR_STRB                  3645
#define G3STRB                        3646
#define COG3STR_STRC                  3647
#define G3STRC                        3648
#define COG3STR_STRD                  3649
#define G3STRD                        3650
#define COG3STR_SDATA                 3651
#define G3SDATA                       3652
#define COG3STR_SDATB                 3653
#define G3SDATB                       3654
#define COG3STR_SDATC                 3655
#define G3SDATC                       3656
#define COG3STR_SDATD                 3657
#define G3SDATD                       3658
#define COG4PHR                       3659
#define COG4PHR_PHR                   3660
#define COG4PHR_PHR0                  3661
#define G4PHR0                        3662
#define COG4PHR_PHR1                  3663
#define G4PHR1                        3664
#define COG4PHR_PHR2                  3665
#define G4PHR2                        3666
#define COG4PHR_PHR3                  3667
#define G4PHR3                        3668
#define COG4PHR_PHR4                  3669
#define G4PHR4                        3670
#define COG4PHR_PHR5                  3671
#define G4PHR5                        3672
#define COG4PHF                       3673
#define COG4PHF_PHF                   3674
#define G4PHF0                        3675
#define COG4PHF_PHF0                  3676
#define G4PHF1                        3677
#define COG4PHF_PHF1                  3678
#define G4PHF2                        3679
#define COG4PHF_PHF2                  3680
#define G4PHF3                        3681
#define COG4PHF_PHF3                  3682
#define G4PHF4                        3683
#define COG4PHF_PHF4                  3684
#define G4PHF5                        3685
#define COG4PHF_PHF5                  3686
#define COG4BLKR                      3687
#define COG4BLKR_BLKR                 3688
#define G4BLKR0                       3689
#define COG4BLKR_BLKR0                3690
#define COG4BLKR_BLKR1                3691
#define G4BLKR1                       3692
#define G4BLKR2                       3693
#define COG4BLKR_BLKR2                3694
#define G4BLKR3                       3695
#define COG4BLKR_BLKR3                3696
#define G4BLKR4                       3697
#define COG4BLKR_BLKR4                3698
#define G4BLKR5                       3699
#define COG4BLKR_BLKR5                3700
#define COG4BLKF                      3701
#define COG4BLKF_BLKF0                3702
#define G4BLKF0                       3703
#define COG4BLKF_BLKF                 3704
#define COG4BLKF_BLKF1                3705
#define G4BLKF1                       3706
#define COG4BLKF_BLKF2                3707
#define G4BLKF2                       3708
#define COG4BLKF_BLKF3                3709
#define G4BLKF3                       3710
#define COG4BLKF_BLKF4                3711
#define G4BLKF4                       3712
#define COG4BLKF_BLKF5                3713
#define G4BLKF5                       3714
#define COG4DBR                       3715
#define COG4DBR_DBR                   3716
#define G4DBR0                        3717
#define COG4DBR_DBR0                  3718
#define G4DBR1                        3719
#define COG4DBR_DBR1                  3720
#define COG4DBR_DBR2                  3721
#define G4DBR2                        3722
#define COG4DBR_DBR3                  3723
#define G4DBR3                        3724
#define COG4DBR_DBR4                  3725
#define G4DBR4                        3726
#define COG4DBR_DBR5                  3727
#define G4DBR5                        3728
#define COG4DBF                       3729
#define G4DBF                         3730
#define COG4DBF_DBF0                  3731
#define G4DBF0                        3732
#define COG4DBF_DBF1                  3733
#define G4DBF1                        3734
#define COG4DBF_DBF2                  3735
#define G4DBF2                        3736
#define COG4DBF_DBF3                  3737
#define G4DBF3                        3738
#define COG4DBF_DBF4                  3739
#define G4DBF4                        3740
#define COG4DBF_DBF5                  3741
#define G4DBF5                        3742
#define COG4CON0                      3743
#define G4MD                          3744
#define G4MD0                         3745
#define COG4CON0_MD                   3746
#define COG4CON0_MD0                  3747
#define G4MD1                         3748
#define COG4CON0_MD1                  3749
#define G4MD2                         3750
#define COG4CON0_MD2                  3751
#define COG4CON0_CS                   3752
#define COG4CON0_CS0                  3753
#define G4CS0                         3754
#define G4CS                          3755
#define COG4CON0_CS1                  3756
#define G4CS1                         3757
#define COG4CON0_LD                   3758
#define G4LD                          3759
#define COG4CON0_EN                   3760
#define G4EN                          3761
#define COG4CON1                      3762
#define G4POLA                        3763
#define COG4CON1_POLA                 3764
#define G4POLB                        3765
#define COG4CON1_POLB                 3766
#define G4POLC                        3767
#define COG4CON1_POLC                 3768
#define G4POLD                        3769
#define COG4CON1_POLD                 3770
#define COG4CON1_FDBS                 3771
#define G4FDBS                        3772
#define G4RDBS                        3773
#define COG4CON1_RDBS                 3774
#define COG4RIS0                      3775
#define COG4RIS0_RIS0                 3776
#define G4RIS0                        3777
#define COG4RIS0_RIS1                 3778
#define G4RIS1                        3779
#define COG4RIS0_RIS2                 3780
#define G4RIS2                        3781
#define COG4RIS0_RIS3                 3782
#define G4RIS3                        3783
#define COG4RIS0_RIS4                 3784
#define G4RIS4                        3785
#define COG4RIS0_RIS5                 3786
#define G4RIS5                        3787
#define COG4RIS0_RIS6                 3788
#define G4RIS6                        3789
#define COG4RIS0_RIS7                 3790
#define G4RIS7                        3791
#define COG4RIS1                      3792
#define G4RIS8                        3793
#define COG4RIS1_RIS8                 3794
#define COG4RIS1_RIS9                 3795
#define G4RIS9                        3796
#define COG4RIS1_RIS10                3797
#define G4RIS10                       3798
#define COG4RIS1_RIS11                3799
#define G4RIS11                       3800
#define COG4RIS1_RIS12                3801
#define G4RIS12                       3802
#define COG4RIS1_RIS13                3803
#define G4RIS13                       3804
#define G4RIS14                       3805
#define COG4RIS1_RIS14                3806
#define COG4RIS1_RIS15                3807
#define G4RIS15                       3808
#define COG4RSIM0                     3809
#define COG4RSIM0_RSIM0               3810
#define G4RSIM0                       3811
#define G4RSIM1                       3812
#define COG4RSIM0_RSIM1               3813
#define COG4RSIM0_RSIM2               3814
#define G4RSIM2                       3815
#define COG4RSIM0_RSIM3               3816
#define G4RSIM3                       3817
#define G4RSIM4                       3818
#define COG4RSIM0_RSIM4               3819
#define COG4RSIM0_RSIM5               3820
#define G4RSIM5                       3821
#define COG4RSIM0_RSIM6               3822
#define G4RSIM6                       3823
#define COG4RSIM0_RSIM7               3824
#define G4RSIM7                       3825
#define COG4RSIM1                     3826
#define COG4RSIM1_RSIM8               3827
#define G4RSIM8                       3828
#define COG4RSIM1_RSIM9               3829
#define G4RSIM9                       3830
#define COG4RSIM1_RSIM10              3831
#define G4RSIM10                      3832
#define COG4RSIM1_RSIM11              3833
#define G4RSIM11                      3834
#define COG4RSIM1_RSIM12              3835
#define G4RSIM12                      3836
#define COG4RSIM1_RSIM13              3837
#define G4RSIM13                      3838
#define COG4RSIM1_RSIM14              3839
#define G4RSIM14                      3840
#define COG4RSIM1_RSIM15              3841
#define G4RSIM15                      3842
#define COG4FIS0                      3843
#define G4FIS0                        3844
#define COG4FIS0_FIS0                 3845
#define G4FIS1                        3846
#define COG4FIS0_FIS1                 3847
#define G4FIS2                        3848
#define COG4FIS0_FIS2                 3849
#define G4FIS3                        3850
#define COG4FIS0_FIS3                 3851
#define G4FIS4                        3852
#define COG4FIS0_FIS4                 3853
#define G4FIS5                        3854
#define COG4FIS0_FIS5                 3855
#define G4FIS6                        3856
#define COG4FIS0_FIS6                 3857
#define G4FIS7                        3858
#define COG4FIS0_FIS7                 3859
#define COG4FIS1                      3860
#define COG4FIS1_FIS8                 3861
#define G4FIS8                        3862
#define COG4FIS1_FIS9                 3863
#define G4FIS9                        3864
#define G4FIS10                       3865
#define COG4FIS1_FIS10                3866
#define G4FIS11                       3867
#define COG4FIS1_FIS11                3868
#define G4FIS12                       3869
#define COG4FIS1_FIS12                3870
#define G4FIS13                       3871
#define COG4FIS1_FIS13                3872
#define G4FIS14                       3873
#define COG4FIS1_FIS14                3874
#define G4FIS15                       3875
#define COG4FIS1_FIS15                3876
#define COG4FSIM0                     3877
#define COG4FSIM0_FSIM0               3878
#define G4FSIM0                       3879
#define COG4FSIM0_FSIM1               3880
