tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1777_tdd.h
#define PWM6PRL4                      4439
#define PWM6PRL5                      4440
#define PWM6PRL6                      4441
#define PWM6PRL7                      4442
#define PWM6PRH_PR                    4443
#define PWM6PRH                       4444
#define PWM6PRH0                      4445
#define PWM6PRH1                      4446
#define PWM6PRH2                      4447
#define PWM6PRH3                      4448
#define PWM6PRH4                      4449
#define PWM6PRH5                      4450
#define PWM6PRH6                      4451
#define PWM6PRH7                      4452
#define PWM6OFL                       4453
#define PWM6OFL0                      4454
#define PWM6OFL_OF                    4455
#define PWM6OFL1                      4456
#define PWM6OFL2                      4457
#define PWM6OFL3                      4458
#define PWM6OFL4                      4459
#define PWM6OFL5                      4460
#define PWM6OFL6                      4461
#define PWM6OFL7                      4462
#define PWM6OFH                       4463
#define PWM6OFH_OF                    4464
#define PWM6OFH0                      4465
#define PWM6OFH1                      4466
#define PWM6OFH2                      4467
#define PWM6OFH3                      4468
#define PWM6OFH4                      4469
#define PWM6OFH5                      4470
#define PWM6OFH6                      4471
#define PWM6OFH7                      4472
#define PWM6TMRL_TMR                  4473
#define PWM6TMRL                      4474
#define PWM6TMRL0                     4475
#define PWM6TMRL1                     4476
#define PWM6TMRL2                     4477
#define PWM6TMRL3                     4478
#define PWM6TMRL4                     4479
#define PWM6TMRL5                     4480
#define PWM6TMRL6                     4481
#define PWM6TMRL7                     4482
#define PWM6TMRH_TMR                  4483
#define PWM6TMRH0                     4484
#define PWM6TMRH                      4485
#define PWM6TMRH1                     4486
#define PWM6TMRH2                     4487
#define PWM6TMRH3                     4488
#define PWM6TMRH4                     4489
#define PWM6TMRH5                     4490
#define PWM6TMRH6                     4491
#define PWM6TMRH7                     4492
#define PWM6CON                       4493
#define PWM6CON_MODE0                 4494
#define PWM6CON_MODE                  4495
#define PWM6MODE                      4496
#define PWM6MODE0                     4497
#define PWM6CON_MODE1                 4498
#define PWM6MODE1                     4499
#define PWM6POL                       4500
#define PWM6CON_POL                   4501
#define PWM6OUT                       4502
#define PWM6CON_OUT                   4503
#define PWM6EN                        4504
#define PWM6CON_EN                    4505
#define PWM6INTE                      4506
#define PWM6PRIE                      4507
#define PWM6INTE_PRIE                 4508
#define PWM6DCIE                      4509
#define PWM6INTE_DCIE                 4510
#define PWM6PHIE                      4511
#define PWM6INTE_PHIE                 4512
#define PWM6INTE_OFIE                 4513
#define PWM6OFIE                      4514
#define PWM6INTF                      4515
#define PWM6INTF_PRIF                 4516
#define PWM6PRIF                      4517
#define PWM6INTF_DCIF                 4518
#define PWM6DCIF                      4519
#define PWM6PHIF                      4520
#define PWM6INTF_PHIF                 4521
#define PWM6OFIF                      4522
#define PWM6INTF_OFIF                 4523
#define PWM6CLKCON                    4524
#define PWM6CLKCON_CS                 4525
#define PWM6CS                        4526
#define PWM6CLKCON_CS0                4527
#define PWM6CS0                       4528
#define PWM6CLKCON_CS1                4529
#define PWM6CS1                       4530
#define PWM6CLKCON_CS2                4531
#define PWM6CS2                       4532
#define PWM6PS                        4533
#define PWM6CLKCON_PS                 4534
#define PWM6PS0                       4535
#define PWM6CLKCON_PS0                4536
#define PWM6PS1                       4537
#define PWM6CLKCON_PS1                4538
#define PWM6CLKCON_PS2                4539
#define PWM6PS2                       4540
#define PWM6LDCON                     4541
#define PWM6LDS                       4542
#define PWM6LDCON_LDS                 4543
#define PWM6LDCON_LDS0                4544
#define PWM6LDS0                      4545
#define PWM6LDCON_LDS1                4546
#define PWM6LDS1                      4547
#define PWM6LDCON_LDT                 4548
#define PWM6LDM                       4549
#define PWM6LD                        4550
#define PWM6LDCON_LDA                 4551
#define PWM6OFCON                     4552
#define PWM6OFS0                      4553
#define PWM6OFCON_OFS                 4554
#define PWM6OFCON_OFS0                4555
#define PWM6OFS                       4556
#define PWM6OFS1                      4557
#define PWM6OFCON_OFS1                4558
#define PWM6OFCON_OFO                 4559
#define PWM6OFMC                      4560
#define PWM6OFM                       4561
#define PWM6OFCON_OFM                 4562
#define PWM6OFM0                      4563
#define PWM6OFCON_OFM0                4564
#define PWM6OFM1                      4565
#define PWM6OFCON_OFM1                4566
#define PWM11PHL_PH                   4567
#define PWM11PHL                      4568
#define PWM11PHL0                     4569
#define PWM11PHL1                     4570
#define PWM11PHL2                     4571
#define PWM11PHL3                     4572
#define PWM11PHL4                     4573
#define PWM11PHL5                     4574
#define PWM11PHL6                     4575
#define PWM11PHL7                     4576
#define PWM11PHH0                     4577
#define PWM11PHH                      4578
#define PWM11PHH_PH                   4579
#define PWM11PHH1                     4580
#define PWM11PHH2                     4581
#define PWM11PHH3                     4582
#define PWM11PHH4                     4583
#define PWM11PHH5                     4584
#define PWM11PHH6                     4585
#define PWM11PHH7                     4586
#define PWM11DCL_DC                   4587
#define PWM11DCL0                     4588
#define PWM11DCL                      4589
#define PWM11DCL1                     4590
#define PWM11DCL2                     4591
#define PWM11DCL3                     4592
#define PWM11DCL4                     4593
#define PWM11DCL5                     4594
#define PWM11DCL6                     4595
#define PWM11DCL7                     4596
#define PWM11DCH0                     4597
#define PWM11DCH_DC                   4598
#define PWM11DCH                      4599
#define PWM11DCH1                     4600
#define PWM11DCH2                     4601
#define PWM11DCH3                     4602
#define PWM11DCH4                     4603
#define PWM11DCH5                     4604
#define PWM11DCH6                     4605
#define PWM11DCH7                     4606
#define PWM11PRL0                     4607
#define PWM11PRL_PR                   4608
#define PWM11PRL                      4609
#define PWM11PRL1                     4610
#define PWM11PRL2                     4611
#define PWM11PRL3                     4612
#define PWM11PRL4                     4613
#define PWM11PRL5                     4614
#define PWM11PRL6                     4615
#define PWM11PRL7                     4616
#define PWM11PRH0                     4617
#define PWM11PRH_PR                   4618
#define PWM11PRH                      4619
#define PWM11PRH1                     4620
#define PWM11PRH2                     4621
#define PWM11PRH3                     4622
#define PWM11PRH4                     4623
#define PWM11PRH5                     4624
#define PWM11PRH6                     4625
#define PWM11PRH7                     4626
#define PWM11OFL_OF                   4627
#define PWM11OFL                      4628
#define PWM11OFL0                     4629
#define PWM11OFL1                     4630
#define PWM11OFL2                     4631
#define PWM11OFL3                     4632
#define PWM11OFL4                     4633
#define PWM11OFL5                     4634
#define PWM11OFL6                     4635
#define PWM11OFL7                     4636
#define PWM11OFH0                     4637
#define PWM11OFH                      4638
#define PWM11OFH_OF                   4639
#define PWM11OFH1                     4640
#define PWM11OFH2                     4641
#define PWM11OFH3                     4642
#define PWM11OFH4                     4643
#define PWM11OFH5                     4644
#define PWM11OFH6                     4645
#define PWM11OFH7                     4646
#define PWM11TMRL_TMR                 4647
#define PWM11TMRL0                    4648
#define PWM11TMRL                     4649
#define PWM11TMRL1                    4650
#define PWM11TMRL2                    4651
#define PWM11TMRL3                    4652
#define PWM11TMRL4                    4653
#define PWM11TMRL5                    4654
#define PWM11TMRL6                    4655
#define PWM11TMRL7                    4656
#define PWM11TMRH_TMR                 4657
#define PWM11TMRH                     4658
#define PWM11TMRH0                    4659
#define PWM11TMRH1                    4660
#define PWM11TMRH2                    4661
#define PWM11TMRH3                    4662
#define PWM11TMRH4                    4663
#define PWM11TMRH5                    4664
#define PWM11TMRH6                    4665
#define PWM11TMRH7                    4666
#define PWM11CON                      4667
#define PWM11MODE0                    4668
#define PWM11MODE                     4669
#define PWM11CON_MODE0                4670
#define PWM11CON_MODE                 4671
#define PWM11MODE1                    4672
#define PWM11CON_MODE1                4673
#define PWM11CON_POL                  4674
#define PWM11POL                      4675
#define PWM11CON_OUT                  4676
#define PWM11OUT                      4677
#define PWM11EN                       4678
#define PWM11CON_EN                   4679
#define PWM11INTE                     4680
#define PWM11INTE_PRIE                4681
#define PWM11PRIE                     4682
#define PWM11INTE_DCIE                4683
#define PWM11DCIE                     4684
#define PWM11INTE_PHIE                4685
#define PWM11PHIE                     4686
#define PWM11INTE_OFIE                4687
#define PWM11OFIE                     4688
#define PWM11INTF                     4689
#define PWM11INTF_PRIF                4690
#define PWM11PRIF                     4691
#define PWM11INTF_DCIF                4692
#define PWM11DCIF                     4693
#define PWM11PHIF                     4694
#define PWM11INTF_PHIF                4695
#define PWM11INTF_OFIF                4696
#define PWM11OFIF                     4697
#define PWM11CLKCON                   4698
#define PWM11CS0                      4699
#define PWM11CLKCON_CS0               4700
#define PWM11CS                       4701
#define PWM11CLKCON_CS                4702
#define PWM11CS1                      4703
#define PWM11CLKCON_CS1               4704
#define PWM11CLKCON_CS2               4705
#define PWM11CS2                      4706
#define PWM11PS0                      4707
#define PWM11PS                       4708
#define PWM11CLKCON_PS                4709
#define PWM11CLKCON_PS0               4710
#define PWM11PS1                      4711
#define PWM11CLKCON_PS1               4712
#define PWM11PS2                      4713
#define PWM11CLKCON_PS2               4714
#define PWM11LDCON                    4715
#define PWM11LDS0                     4716
#define PWM11LDCON_LDS                4717
#define PWM11LDCON_LDS0               4718
#define PWM11LDS                      4719
#define PWM11LDS1                     4720
#define PWM11LDCON_LDS1               4721
#define PWM11LDM                      4722
#define PWM11LDCON_LDT                4723
#define PWM11LD                       4724
#define PWM11LDCON_LDA                4725
#define PWM11OFCON                    4726
#define PWM11OFS0                     4727
#define PWM11OFCON_OFS0               4728
#define PWM11OFS                      4729
#define PWM11OFCON_OFS                4730
#define PWM11OFCON_OFS1               4731
#define PWM11OFS1                     4732
#define PWM11OFCON_OFO                4733
#define PWM11OFMC                     4734
#define PWM11OFCON_OFM0               4735
#define PWM11OFCON_OFM                4736
#define PWM11OFM                      4737
#define PWM11OFM0                     4738
#define PWM11OFCON_OFM1               4739
#define PWM11OFM1                     4740
#define PWM12PHL0                     4741
#define PWM12PHL_PH                   4742
#define PWM12PHL                      4743
#define PWM12PHL1                     4744
#define PWM12PHL2                     4745
#define PWM12PHL3                     4746
#define PWM12PHL4                     4747
#define PWM12PHL5                     4748
#define PWM12PHL6                     4749
#define PWM12PHL7                     4750
#define PWM12PHH                      4751
#define PWM12PHH0                     4752
#define PWM12PHH_PH                   4753
#define PWM12PHH1                     4754
#define PWM12PHH2                     4755
#define PWM12PHH3                     4756
#define PWM12PHH4                     4757
#define PWM12PHH5                     4758
#define PWM12PHH6                     4759
#define PWM12PHH7                     4760
#define PWM12DCL_DC                   4761
#define PWM12DCL0                     4762
#define PWM12DCL                      4763
#define PWM12DCL1                     4764
#define PWM12DCL2                     4765
#define PWM12DCL3                     4766
#define PWM12DCL4                     4767
#define PWM12DCL5                     4768
#define PWM12DCL6                     4769
#define PWM12DCL7                     4770
#define PWM12DCH_DC                   4771
#define PWM12DCH                      4772
#define PWM12DCH0                     4773
#define PWM12DCH1                     4774
#define PWM12DCH2                     4775
#define PWM12DCH3                     4776
#define PWM12DCH4                     4777
#define PWM12DCH5                     4778
#define PWM12DCH6                     4779
#define PWM12DCH7                     4780
#define PWM12PRL                      4781
#define PWM12PRL0                     4782
#define PWM12PRL_PR                   4783
#define PWM12PRL1                     4784
#define PWM12PRL2                     4785
#define PWM12PRL3                     4786
#define PWM12PRL4                     4787
#define PWM12PRL5                     4788
#define PWM12PRL6                     4789
#define PWM12PRL7                     4790
#define PWM12PRH                      4791
#define PWM12PRH_PR                   4792
#define PWM12PRH0                     4793
#define PWM12PRH1                     4794
#define PWM12PRH2                     4795
#define PWM12PRH3                     4796
#define PWM12PRH4                     4797
#define PWM12PRH5                     4798
#define PWM12PRH6                     4799
#define PWM12PRH7                     4800
#define PWM12OFL0                     4801
#define PWM12OFL_OF                   4802
#define PWM12OFL                      4803
#define PWM12OFL1                     4804
#define PWM12OFL2                     4805
#define PWM12OFL3                     4806
#define PWM12OFL4                     4807
#define PWM12OFL5                     4808
#define PWM12OFL6                     4809
#define PWM12OFL7                     4810
#define PWM12OFH_OF                   4811
#define PWM12OFH                      4812
#define PWM12OFH0                     4813
#define PWM12OFH1                     4814
#define PWM12OFH2                     4815
#define PWM12OFH3                     4816
#define PWM12OFH4                     4817
#define PWM12OFH5                     4818
#define PWM12OFH6                     4819
#define PWM12OFH7                     4820
#define PWM12TMRL0                    4821
#define PWM12TMRL_TMR                 4822
#define PWM12TMRL                     4823
#define PWM12TMRL1                    4824
#define PWM12TMRL2                    4825
#define PWM12TMRL3                    4826
#define PWM12TMRL4                    4827
#define PWM12TMRL5                    4828
#define PWM12TMRL6                    4829
#define PWM12TMRL7                    4830
#define PWM12TMRH                     4831
#define PWM12TMRH0                    4832
#define PWM12TMRH_TMR                 4833
#define PWM12TMRH1                    4834
#define PWM12TMRH2                    4835
#define PWM12TMRH3                    4836
#define PWM12TMRH4                    4837
#define PWM12TMRH5                    4838
#define PWM12TMRH6                    4839
#define PWM12TMRH7                    4840
#define PWM12CON                      4841
#define PWM12CON_MODE                 4842
#define PWM12MODE                     4843
#define PWM12MODE0                    4844
#define PWM12CON_MODE0                4845
#define PWM12CON_MODE1                4846
#define PWM12MODE1                    4847
#define PWM12CON_POL                  4848
#define PWM12POL                      4849
#define PWM12CON_OUT                  4850
#define PWM12OUT                      4851
#define PWM12EN                       4852
#define PWM12CON_EN                   4853
#define PWM12INTE                     4854
#define PWM12PRIE                     4855
#define PWM12INTE_PRIE                4856
#define PWM12DCIE                     4857
#define PWM12INTE_DCIE                4858
#define PWM12INTE_PHIE                4859
#define PWM12PHIE                     4860
#define PWM12INTE_OFIE                4861
#define PWM12OFIE                     4862
#define PWM12INTF                     4863
#define PWM12INTF_PRIF                4864
#define PWM12PRIF                     4865
#define PWM12INTF_DCIF                4866
#define PWM12DCIF                     4867
#define PWM12PHIF                     4868
#define PWM12INTF_PHIF                4869
#define PWM12OFIF                     4870
#define PWM12INTF_OFIF                4871
#define PWM12CLKCON                   4872
#define PWM12CS0                      4873
#define PWM12CLKCON_CS                4874
#define PWM12CS                       4875
#define PWM12CLKCON_CS0               4876
#define PWM12CS1                      4877
#define PWM12CLKCON_CS1               4878
#define PWM12CS2                      4879
#define PWM12CLKCON_CS2               4880
#define PWM12CLKCON_PS                4881
#define PWM12PS0                      4882
#define PWM12CLKCON_PS0               4883
#define PWM12PS                       4884
#define PWM12PS1                      4885
#define PWM12CLKCON_PS1               4886
#define PWM12PS2                      4887
#define PWM12CLKCON_PS2               4888
#define PWM12LDCON                    4889
#define PWM12LDCON_LDS0               4890
#define PWM12LDCON_LDS                4891
#define PWM12LDS                      4892
#define PWM12LDS0                     4893
#define PWM12LDS1                     4894
#define PWM12LDCON_LDS1               4895
#define PWM12LDCON_LDT                4896
#define PWM12LDM                      4897
#define PWM12LD                       4898
#define PWM12LDCON_LDA                4899
#define PWM12OFCON                    4900
#define PWM12OFCON_OFS0               4901
#define PWM12OFS                      4902
#define PWM12OFCON_OFS                4903
#define PWM12OFS0                     4904
#define PWM12OFCON_OFS1               4905
#define PWM12OFS1                     4906
#define PWM12OFMC                     4907
#define PWM12OFCON_OFO                4908
#define PWM12OFM0                     4909
#define PWM12OFCON_OFM                4910
#define PWM12OFCON_OFM0               4911
#define PWM12OFM                      4912
#define PWM12OFM1                     4913
#define PWM12OFCON_OFM1               4914
#define PPSLOCK                       4915
#define PPSLOCKED                     4916
#define INTPPS                        4917
#define T0CKIPPS                      4918
#define T1CKIPPS                      4919
#define T1GPPS                        4920
#define T3CKIPPS                      4921
#define T3GPPS                        4922
#define T5CKIPPS                      4923
#define T5GPPS                        4924
#define T2INPPS                       4925
#define T4INPPS                       4926
#define T6INPPS                       4927
#define T8INPPS                       4928
#define CCP1PPS                       4929
#define CCP2PPS                       4930
#define CCP7PPS                       4931
#define CCP8PPS                       4932
#define COG1INPPS                     4933
#define COG2INPPS                     4934
#define COG3INPPS                     4935
#define COG4INPPS                     4936
#define MD1CLPPS                      4937
#define MD1CHPPS                      4938
#define MD1MODPPS                     4939
#define MD2CLPPS                      4940
#define MD2CHPPS                      4941
#define MD2MODPPS                     4942
#define MD3CLPPS                      4943
#define MD3CHPPS                      4944
#define MD3MODPPS                     4945
#define MD4CLPPS                      4946
#define MD4CHPPS                      4947
#define MD4MODPPS                     4948
#define PRG1RPPS                      4949
#define PRG1FPPS                      4950
#define PRG2RPPS                      4951
#define PRG2FPPS                      4952
#define PRG3RPPS                      4953
#define PRG3FPPS                      4954
#define PRG4RPPS                      4955
#define PRG4FPPS                      4956
#define CLCIN0PPS                     4957
#define CLCIN1PPS                     4958
#define CLCIN2PPS                     4959
#define CLCIN3PPS                     4960
#define ADCACTPPS                     4961
#define SSPCLKPPS                     4962
#define SSPDATPPS                     4963
#define SSPSSPPS                      4964
#define RXPPS                         4965
#define CKPPS                         4966
#define RA0PPS                        4967
#define RA1PPS                        4968
#define RA2PPS                        4969
#define RA3PPS                        4970
#define RA4PPS                        4971
#define RA5PPS                        4972
#define RA6PPS                        4973
#define RA7PPS                        4974
#define RB0PPS                        4975
#define RB1PPS                        4976
#define RB2PPS                        4977
#define RB3PPS                        4978
#define RB4PPS                        4979
#define RB5PPS                        4980
#define RB6PPS                        4981
#define RB7PPS                        4982
#define RC0PPS                        4983
#define RC1PPS                        4984
#define RC2PPS                        4985
#define RC3PPS                        4986
#define RC4PPS                        4987
#define RC5PPS                        4988
#define RC6PPS                        4989
#define RC7PPS                        4990
#define RD0PPS                        4991
#define RD1PPS                        4992
#define RD2PPS                        4993
#define RD3PPS                        4994
#define RD4PPS                        4995
#define RD5PPS                        4996
