tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1777_tdd.h
#define RD6PPS                        4997
#define RD7PPS                        4998
#define RE0PPS                        4999
#define RE1PPS                        5000
#define RE2PPS                        5001
#define CLCDATA                       5002
#define MCLC1OUT                      5003
#define MCLC2OUT                      5004
#define MCLC3OUT                      5005
#define MLC4OUT                       5006
#define CLC1CON                       5007
#define CLC1CON_MODE                  5008
#define LC1MODE0                      5009
#define LC1MODE                       5010
#define CLC1CON_MODE0                 5011
#define LC1MODE1                      5012
#define CLC1CON_MODE1                 5013
#define CLC1CON_MODE2                 5014
#define LC1MODE2                      5015
#define LC1INTN                       5016
#define CLC1CON_INTN                  5017
#define LC1INTP                       5018
#define CLC1CON_INTP                  5019
#define CLC1CON_OUT                   5020
#define LC1OUT                        5021
#define LC1EN                         5022
#define CLC1CON_EN                    5023
#define CLC1POL                       5024
#define LC1G1POL                      5025
#define CLC1POL_G1POL                 5026
#define CLC1POL_G2POL                 5027
#define LC1G2POL                      5028
#define LC1G3POL                      5029
#define CLC1POL_G3POL                 5030
#define LC1G4POL                      5031
#define CLC1POL_G4POL                 5032
#define CLC1POL_POL                   5033
#define LC1POL                        5034
#define CLC1SEL0                      5035
#define CLC1SEL0_D1S0                 5036
#define LC1D1S0                       5037
#define CLC1SEL0_D1S                  5038
#define LC1D1S                        5039
#define CLC1SEL0_D1S1                 5040
#define LC1D1S1                       5041
#define CLC1SEL0_D1S2                 5042
#define LC1D1S2                       5043
#define LC1D1S3                       5044
#define CLC1SEL0_D1S3                 5045
#define CLC1SEL0_D1S4                 5046
#define LC1D1S4                       5047
#define CLC1SEL0_D1S5                 5048
#define LC1D1S5                       5049
#define CLC1SEL1                      5050
#define CLC1SEL1_D2S0                 5051
#define CLC1SEL1_D2S                  5052
#define LC1D2S                        5053
#define LC1D2S0                       5054
#define CLC1SEL1_D2S1                 5055
#define LC1D2S1                       5056
#define CLC1SEL1_D2S2                 5057
#define LC1D2S2                       5058
#define LC1D2S3                       5059
#define CLC1SEL1_D2S3                 5060
#define LC1D2S4                       5061
#define CLC1SEL1_D2S4                 5062
#define LC1D2S5                       5063
#define CLC1SEL1_D2S5                 5064
#define CLC1SEL2                      5065
#define LC1D3S0                       5066
#define CLC1SEL2_D3S                  5067
#define LC1D3S                        5068
#define CLC1SEL2_D3S0                 5069
#define LC1D3S1                       5070
#define CLC1SEL2_D3S1                 5071
#define LC1D3S2                       5072
#define CLC1SEL2_D3S2                 5073
#define LC1D3S3                       5074
#define CLC1SEL2_D3S3                 5075
#define LC1D3S4                       5076
#define CLC1SEL2_D3S4                 5077
#define LC1D3S5                       5078
#define CLC1SEL2_D3S5                 5079
#define CLC1SEL3                      5080
#define CLC1SEL3_D4S                  5081
#define LC1D4S                        5082
#define LC1D4S0                       5083
#define CLC1SEL3_D4S0                 5084
#define CLC1SEL3_D4S1                 5085
#define LC1D4S1                       5086
#define LC1D4S2                       5087
#define CLC1SEL3_D4S2                 5088
#define LC1D4S3                       5089
#define CLC1SEL3_D4S3                 5090
#define LC1D4S4                       5091
#define CLC1SEL3_D4S4                 5092
#define LC1D4S5                       5093
#define CLC1SEL3_D4S5                 5094
#define CLC1GLS0                      5095
#define CLC1GLS0_D1N                  5096
#define LC1G1D1N                      5097
#define CLC1GLS0_D1T                  5098
#define LC1G1D1T                      5099
#define LC1G1D2N                      5100
#define CLC1GLS0_D2N                  5101
#define LC1G1D2T                      5102
#define CLC1GLS0_D2T                  5103
#define CLC1GLS0_D3N                  5104
#define LC1G1D3N                      5105
#define CLC1GLS0_D3T                  5106
#define LC1G1D3T                      5107
#define CLC1GLS0_D4N                  5108
#define LC1G1D4N                      5109
#define CLC1GLS0_D4T                  5110
#define LC1G1D4T                      5111
#define CLC1GLS1                      5112
#define CLC1GLS1_D1N                  5113
#define LC1G2D1N                      5114
#define LC1G2D1T                      5115
#define CLC1GLS1_D1T                  5116
#define CLC1GLS1_D2N                  5117
#define LC1G2D2N                      5118
#define LC1G2D2T                      5119
#define CLC1GLS1_D2T                  5120
#define CLC1GLS1_D3N                  5121
#define LC1G2D3N                      5122
#define LC1G2D3T                      5123
#define CLC1GLS1_D3T                  5124
#define CLC1GLS1_D4N                  5125
#define LC1G2D4N                      5126
#define LC1G2D4T                      5127
#define CLC1GLS1_D4T                  5128
#define CLC1GLS2                      5129
#define CLC1GLS2_D1N                  5130
#define LC1G3D1N                      5131
#define LC1G3D1T                      5132
#define CLC1GLS2_D1T                  5133
#define LC1G3D2N                      5134
#define CLC1GLS2_D2N                  5135
#define LC1G3D2T                      5136
#define CLC1GLS2_D2T                  5137
#define CLC1GLS2_D3N                  5138
#define LC1G3D3N                      5139
#define LC1G3D3T                      5140
#define CLC1GLS2_D3T                  5141
#define LC1G3D4N                      5142
#define CLC1GLS2_D4N                  5143
#define LC1G3D4T                      5144
#define CLC1GLS2_D4T                  5145
#define CLC1GLS3                      5146
#define LC1G4D1N                      5147
#define CLC1GLS3_G4D1N                5148
#define LC1G4D1T                      5149
#define CLC1GLS3_G4D1T                5150
#define CLC1GLS3_G4D2N                5151
#define LC1G4D2N                      5152
#define CLC1GLS3_G4D2T                5153
#define LC1G4D2T                      5154
#define LC1G4D3N                      5155
#define CLC1GLS3_G4D3N                5156
#define LC1G4D3T                      5157
#define CLC1GLS3_G4D3T                5158
#define CLC1GLS3_G4D4N                5159
#define LC1G4D4N                      5160
#define CLC1GLS3_G4D4T                5161
#define LC1G4D4T                      5162
#define CLC2CON                       5163
#define LC2MODE0                      5164
#define CLC2CON_MODE                  5165
#define LC2MODE                       5166
#define CLC2CON_MODE0                 5167
#define LC2MODE1                      5168
#define CLC2CON_MODE1                 5169
#define LC2MODE2                      5170
#define CLC2CON_MODE2                 5171
#define LC2INTN                       5172
#define CLC2CON_INTN                  5173
#define LC2INTP                       5174
#define CLC2CON_INTP                  5175
#define CLC2CON_OUT                   5176
#define LC2OUT                        5177
#define CLC2CON_EN                    5178
#define LC2EN                         5179
#define CLC2POL                       5180
#define LC2G1POL                      5181
#define CLC2POL_G1POL                 5182
#define LC2G2POL                      5183
#define CLC2POL_G2POL                 5184
#define LC2G3POL                      5185
#define CLC2POL_G3POL                 5186
#define LC2G4POL                      5187
#define CLC2POL_G4POL                 5188
#define CLC2POL_POL                   5189
#define LC2POL                        5190
#define CLC2SEL0                      5191
#define CLC2SEL0_D1S                  5192
#define LC2D1S0                       5193
#define CLC2SEL0_D1S0                 5194
#define LC2D1S                        5195
#define LC2D1S1                       5196
#define CLC2SEL0_D1S1                 5197
#define LC2D1S2                       5198
#define CLC2SEL0_D1S2                 5199
#define CLC2SEL0_D1S3                 5200
#define LC2D1S3                       5201
#define LC2D1S4                       5202
#define CLC2SEL0_D1S4                 5203
#define LC2D1S5                       5204
#define CLC2SEL0_D1S5                 5205
#define CLC2SEL1                      5206
#define LC2D2S0                       5207
#define CLC2SEL1_D2S0                 5208
#define LC2D2S                        5209
#define CLC2SEL1_D2S                  5210
#define LC2D2S1                       5211
#define CLC2SEL1_D2S1                 5212
#define LC2D2S2                       5213
#define CLC2SEL1_D2S2                 5214
#define LC2D2S3                       5215
#define CLC2SEL1_D2S3                 5216
#define LC2D2S4                       5217
#define CLC2SEL1_D2S4                 5218
#define LC2D2S5                       5219
#define CLC2SEL1_D2S5                 5220
#define CLC2SEL2                      5221
#define CLC2SEL2_D3S                  5222
#define LC2D3S0                       5223
#define CLC2SEL2_D3S0                 5224
#define LC2D3S                        5225
#define CLC2SEL2_D3S1                 5226
#define LC2D3S1                       5227
#define LC2D3S2                       5228
#define CLC2SEL2_D3S2                 5229
#define LC2D3S3                       5230
#define CLC2SEL2_D3S3                 5231
#define LC2D3S4                       5232
#define CLC2SEL2_D3S4                 5233
#define LC2D3S5                       5234
#define CLC2SEL2_D3S5                 5235
#define CLC2SEL3                      5236
#define LC2D4S0                       5237
#define CLC2SEL3_D4S                  5238
#define CLC2SEL3_D4S0                 5239
#define LC2D4S                        5240
#define LC2D4S1                       5241
#define CLC2SEL3_D4S1                 5242
#define LC2D4S2                       5243
#define CLC2SEL3_D4S2                 5244
#define CLC2SEL3_D4S3                 5245
#define LC2D4S3                       5246
#define LC2D4S4                       5247
#define CLC2SEL3_D4S4                 5248
#define LC2D4S5                       5249
#define CLC2SEL3_D4S5                 5250
#define CLC2GLS0                      5251
#define LC2G1D1N                      5252
#define CLC2GLS0_D1N                  5253
#define CLC2GLS0_D1T                  5254
#define LC2G1D1T                      5255
#define LC2G1D2N                      5256
#define CLC2GLS0_D2N                  5257
#define CLC2GLS0_D2T                  5258
#define LC2G1D2T                      5259
#define LC2G1D3N                      5260
#define CLC2GLS0_D3N                  5261
#define CLC2GLS0_D3T                  5262
#define LC2G1D3T                      5263
#define LC2G1D4N                      5264
#define CLC2GLS0_D4N                  5265
#define CLC2GLS0_D4T                  5266
#define LC2G1D4T                      5267
#define CLC2GLS1                      5268
#define CLC2GLS1_D1N                  5269
#define LC2G2D1N                      5270
#define CLC2GLS1_D1T                  5271
#define LC2G2D1T                      5272
#define CLC2GLS1_D2N                  5273
#define LC2G2D2N                      5274
#define CLC2GLS1_D2T                  5275
#define LC2G2D2T                      5276
#define LC2G2D3N                      5277
#define CLC2GLS1_D3N                  5278
#define LC2G2D3T                      5279
#define CLC2GLS1_D3T                  5280
#define LC2G2D4N                      5281
#define CLC2GLS1_D4N                  5282
#define LC2G2D4T                      5283
#define CLC2GLS1_D4T                  5284
#define CLC2GLS2                      5285
#define LC2G3D1N                      5286
#define CLC2GLS2_D1N                  5287
#define CLC2GLS2_D1T                  5288
#define LC2G3D1T                      5289
#define CLC2GLS2_D2N                  5290
#define LC2G3D2N                      5291
#define LC2G3D2T                      5292
#define CLC2GLS2_D2T                  5293
#define CLC2GLS2_D3N                  5294
#define LC2G3D3N                      5295
#define CLC2GLS2_D3T                  5296
#define LC2G3D3T                      5297
#define CLC2GLS2_D4N                  5298
#define LC2G3D4N                      5299
#define LC2G3D4T                      5300
#define CLC2GLS2_D4T                  5301
#define CLC2GLS3                      5302
#define LC2G4D1N                      5303
#define CLC2GLS3_G4D1N                5304
#define CLC2GLS3_G4D1T                5305
#define LC2G4D1T                      5306
#define CLC2GLS3_G4D2N                5307
#define LC2G4D2N                      5308
#define LC2G4D2T                      5309
#define CLC2GLS3_G4D2T                5310
#define CLC2GLS3_G4D3N                5311
#define LC2G4D3N                      5312
#define CLC2GLS3_G4D3T                5313
#define LC2G4D3T                      5314
#define LC2G4D4N                      5315
#define CLC2GLS3_G4D4N                5316
#define CLC2GLS3_G4D4T                5317
#define LC2G4D4T                      5318
#define CLC3CON                       5319
#define LC3MODE0                      5320
#define CLC3CON_MODE0                 5321
#define CLC3CON_MODE                  5322
#define LC3MODE                       5323
#define LC3MODE1                      5324
#define CLC3CON_MODE1                 5325
#define LC3MODE2                      5326
#define CLC3CON_MODE2                 5327
#define LC3INTN                       5328
#define CLC3CON_INTN                  5329
#define CLC3CON_INTP                  5330
#define LC3INTP                       5331
#define CLC3CON_OUT                   5332
#define LC3OUT                        5333
#define LC3EN                         5334
#define CLC3CON_EN                    5335
#define CLC3POL                       5336
#define LC3G1POL                      5337
#define CLC3POL_G1POL                 5338
#define LC3G2POL                      5339
#define CLC3POL_G2POL                 5340
#define CLC3POL_G3POL                 5341
#define LC3G3POL                      5342
#define LC3G4POL                      5343
#define CLC3POL_G4POL                 5344
#define LC3POL                        5345
#define CLC3POL_POL                   5346
#define CLC3SEL0                      5347
#define CLC3SEL0_D1S0                 5348
#define LC3D1S0                       5349
#define CLC3SEL0_D1S                  5350
#define LC3D1S                        5351
#define LC3D1S1                       5352
#define CLC3SEL0_D1S1                 5353
#define LC3D1S2                       5354
#define CLC3SEL0_D1S2                 5355
#define LC3D1S3                       5356
#define CLC3SEL0_D1S3                 5357
#define LC3D1S4                       5358
#define CLC3SEL0_D1S4                 5359
#define LC3D1S5                       5360
#define CLC3SEL0_D1S5                 5361
#define CLC3SEL1                      5362
#define CLC3SEL1_D2S                  5363
#define CLC3SEL1_D2S0                 5364
#define LC3D2S                        5365
#define LC3D2S0                       5366
#define CLC3SEL1_D2S1                 5367
#define LC3D2S1                       5368
#define CLC3SEL1_D2S2                 5369
#define LC3D2S2                       5370
#define CLC3SEL1_D2S3                 5371
#define LC3D2S3                       5372
#define CLC3SEL1_D2S4                 5373
#define LC3D2S4                       5374
#define CLC3SEL1_D2S5                 5375
#define LC3D2S5                       5376
#define CLC3SEL2                      5377
#define LC3D3S                        5378
#define CLC3SEL2_D3S                  5379
#define LC3D3S0                       5380
#define CLC3SEL2_D3S0                 5381
#define LC3D3S1                       5382
#define CLC3SEL2_D3S1                 5383
#define LC3D3S2                       5384
#define CLC3SEL2_D3S2                 5385
#define LC3D3S3                       5386
#define CLC3SEL2_D3S3                 5387
#define CLC3SEL2_D3S4                 5388
#define LC3D3S4                       5389
#define CLC3SEL2_D3S5                 5390
#define LC3D3S5                       5391
#define CLC3SEL3                      5392
#define CLC3SEL3_D4S0                 5393
#define LC3D4S0                       5394
#define CLC3SEL3_D4S                  5395
#define LC3D4S                        5396
#define LC3D4S1                       5397
#define CLC3SEL3_D4S1                 5398
#define LC3D4S2                       5399
#define CLC3SEL3_D4S2                 5400
#define LC3D4S3                       5401
#define CLC3SEL3_D4S3                 5402
#define LC3D4S4                       5403
#define CLC3SEL3_D4S4                 5404
#define LC3D4S5                       5405
#define CLC3SEL3_D4S5                 5406
#define CLC3GLS0                      5407
#define CLC3GLS0_D1N                  5408
#define LC3G1D1N                      5409
#define LC3G1D1T                      5410
#define CLC3GLS0_D1T                  5411
#define LC3G1D2N                      5412
#define CLC3GLS0_D2N                  5413
#define CLC3GLS0_D2T                  5414
#define LC3G1D2T                      5415
#define CLC3GLS0_D3N                  5416
#define LC3G1D3N                      5417
#define LC3G1D3T                      5418
#define CLC3GLS0_D3T                  5419
#define CLC3GLS0_D4N                  5420
#define LC3G1D4N                      5421
#define CLC3GLS0_D4T                  5422
#define LC3G1D4T                      5423
#define CLC3GLS1                      5424
#define LC3G2D1N                      5425
#define CLC3GLS1_D1N                  5426
#define CLC3GLS1_D1T                  5427
#define LC3G2D1T                      5428
#define LC3G2D2N                      5429
#define CLC3GLS1_D2N                  5430
#define LC3G2D2T                      5431
#define CLC3GLS1_D2T                  5432
#define LC3G2D3N                      5433
#define CLC3GLS1_D3N                  5434
#define CLC3GLS1_D3T                  5435
#define LC3G2D3T                      5436
#define LC3G2D4N                      5437
#define CLC3GLS1_D4N                  5438
#define LC3G2D4T                      5439
#define CLC3GLS1_D4T                  5440
#define CLC3GLS2                      5441
#define LC3G3D1N                      5442
#define CLC3GLS2_D1N                  5443
#define LC3G3D1T                      5444
#define CLC3GLS2_D1T                  5445
#define CLC3GLS2_D2N                  5446
#define LC3G3D2N                      5447
#define CLC3GLS2_D2T                  5448
#define LC3G3D2T                      5449
#define CLC3GLS2_D3N                  5450
#define LC3G3D3N                      5451
#define LC3G3D3T                      5452
#define CLC3GLS2_D3T                  5453
#define CLC3GLS2_D4N                  5454
#define LC3G3D4N                      5455
#define CLC3GLS2_D4T                  5456
#define LC3G3D4T                      5457
#define CLC3GLS3                      5458
#define LC3G4D1N                      5459
#define CLC3GLS3_G4D1N                5460
#define LC3G4D1T                      5461
#define CLC3GLS3_G4D1T                5462
#define LC3G4D2N                      5463
#define CLC3GLS3_G4D2N                5464
#define CLC3GLS3_G4D2T                5465
#define LC3G4D2T                      5466
#define LC3G4D3N                      5467
#define CLC3GLS3_G4D3N                5468
#define CLC3GLS3_G4D3T                5469
#define LC3G4D3T                      5470
#define LC3G4D4N                      5471
#define CLC3GLS3_G4D4N                5472
#define LC3G4D4T                      5473
#define CLC3GLS3_G4D4T                5474
#define CLC4CON                       5475
#define LC4MODE                       5476
#define CLC4CON_MODE                  5477
#define LC4MODE0                      5478
#define CLC4CON_MODE0                 5479
#define LC4MODE1                      5480
#define CLC4CON_MODE1                 5481
#define LC4MODE2                      5482
#define CLC4CON_MODE2                 5483
#define LC4INTN                       5484
#define CLC4CON_INTN                  5485
#define CLC4CON_INTP                  5486
#define LC4INTP                       5487
#define CLC4CON_OUT                   5488
#define LC4OUT                        5489
#define CLC4CON_EN                    5490
#define LC4EN                         5491
#define CLC4POL                       5492
#define CLC4POL_G1POL                 5493
#define LC4G1POL                      5494
#define CLC4POL_G2POL                 5495
#define LC4G2POL                      5496
#define CLC4POL_G3POL                 5497
#define LC4G3POL                      5498
#define LC4G4POL                      5499
#define CLC4POL_G4POL                 5500
#define LC4POL                        5501
#define CLC4POL_POL                   5502
#define CLC4SEL0                      5503
#define CLC4SEL0_D1S0                 5504
#define LC4D1S0                       5505
#define CLC4SEL0_D1S                  5506
#define LC4D1S                        5507
#define CLC4SEL0_D1S1                 5508
#define LC4D1S1                       5509
#define CLC4SEL0_D1S2                 5510
#define LC4D1S2                       5511
#define CLC4SEL0_D1S3                 5512
#define LC4D1S3                       5513
#define CLC4SEL0_D1S4                 5514
#define LC4D1S4                       5515
#define CLC4SEL0_D1S5                 5516
#define LC4D1S5                       5517
#define CLC4SEL1                      5518
#define LC4D2S0                       5519
#define CLC4SEL1_D2S                  5520
#define CLC4SEL1_D2S0                 5521
#define LC4D2S                        5522
#define CLC4SEL1_D2S1                 5523
#define LC4D2S1                       5524
#define LC4D2S2                       5525
#define CLC4SEL1_D2S2                 5526
#define LC4D2S3                       5527
#define CLC4SEL1_D2S3                 5528
#define LC4D2S4                       5529
#define CLC4SEL1_D2S4                 5530
#define LC4D2S5                       5531
#define CLC4SEL1_D2S5                 5532
#define CLC4SEL2                      5533
#define LC4D3S                        5534
#define CLC4SEL2_D3S                  5535
#define CLC4SEL2_D3S0                 5536
#define LC4D3S0                       5537
#define LC4D3S1                       5538
#define CLC4SEL2_D3S1                 5539
#define CLC4SEL2_D3S2                 5540
#define LC4D3S2                       5541
#define CLC4SEL2_D3S3                 5542
#define LC4D3S3                       5543
#define CLC4SEL2_D3S4                 5544
#define LC4D3S4                       5545
#define CLC4SEL2_D3S5                 5546
#define LC4D3S5                       5547
#define CLC4SEL3                      5548
#define LC4D4S0                       5549
#define LC4D4S                        5550
#define CLC4SEL3_D4S0                 5551
#define CLC4SEL3_D4S                  5552
#define LC4D4S1                       5553
#define CLC4SEL3_D4S1                 5554
